{"<OOV>": 1, "to": 2, "my": 3, "and": 4, "need": 5, "i": 6, "for": 7, "have": 8, "000": 9, "a": 10, "coverage": 11, "income": 12, "insurance": 13, "the": 14, "last": 15, "was": 16, "what": 17, "records": 18, "medicare": 19, "i'm": 20, "in": 21, "is": 22, "plan": 23, "disability": 24, "from": 25, "health": 26, "virginia": 27, "year": 28, "but": 29, "company": 30, "job": 31, "spouse": 32, "two": 33, "out": 34, "form": 35, "medicaid": 36, "kids": 37, "documentation": 38, "about": 39, "one": 40, "needs": 41, "me": 42, "work": 43, "of": 44, "know": 45, "fill": 46, "release": 47, "on": 48, "applying": 49, "single": 50, "with": 51, "sure": 52, "month": 53, "as": 54, "forms": 55, "making": 56, "wife": 57, "do": 58, "can't": 59, "due": 60, "lost": 61, "continue": 62, "children": 63, "were": 64, "paperwork": 65, "doctor": 66, "medical": 67, "at": 68, "authorize": 69, "this": 70, "household": 71, "around": 72, "three": 73, "not": 74, "all": 75, "provide": 76, "add": 77, "she": 78, "get": 79, "benefits": 80, "right": 81, "submit": 82, "everything": 83, "got": 84, "advantage": 85, "want": 86, "therapist": 87, "surgery": 88, "that": 89, "approximately": 90, "ages": 91, "4": 92, "uninsured": 93, "employer": 94, "position": 95, "afford": 96, "son": 97, "made": 98, "live": 99, "next": 100, "no": 101, "been": 102, "his": 103, "proof": 104, "self": 105, "employed": 106, "chronic": 107, "pregnant": 108, "after": 109, "child": 110, "qualify": 111, "now": 112, "previous": 113, "enroll": 114, "recently": 115, "who": 116, "also": 117, "covered": 118, "day": 119, "november": 120, "15th": 121, "keep": 122, "our": 123, "going": 124, "wants": 125, "send": 126, "specialist": 127, "johns": 128, "hopkins": 129, "it's": 130, "second": 131, "opinion": 132, "heart": 133, "condition": 134, "28": 135, "parent": 136, "really": 137, "help": 138, "healthcare": 139, "costs": 140, "newborn": 141, "daughter": 142, "born": 143, "her": 144, "enrolled": 145, "soon": 146, "possible": 147, "multiple": 148, "sclerosis": 149, "neurologist": 150, "has": 151, "properly": 152, "laid": 153, "off": 154, "weeks": 155, "ago": 156, "had": 157, "60": 158, "employees": 159, "55k": 160, "kid": 161, "moving": 162, "another": 163, "during": 164, "open": 165, "enrollment": 166, "switch": 167, "better": 168, "prescription": 169, "let": 170, "physical": 171, "access": 172, "hospital": 173, "sign": 174, "something": 175, "don't": 176, "mother": 177, "32": 178, "annually": 179, "7": 180, "currently": 181, "terminated": 182, "friday": 183, "diabetes": 184, "lose": 185, "teenage": 186, "48": 187, "prove": 188, "status": 189, "rheumatoid": 190, "arthritis": 191, "it": 192, "qualifies": 193, "they": 194, "just": 195, "married": 196, "doesn't": 197, "any": 198, "other": 199, "freelance": 200, "varies": 201, "lot": 202, "19": 203, "myself": 204, "much": 205, "downsizing": 206, "losing": 207, "continuing": 208, "8": 209, "years": 210, "immunization": 211, "transferred": 212, "new": 213, "school": 214, "pediatrician's": 215, "office": 216, "said": 217, "application": 218, "41": 219, "per": 220, "switching": 221, "regular": 222, "make": 223, "lupus": 224, "kidney": 225, "disease": 226, "document": 227, "rheumatologist": 228, "nephrologist": 229, "both": 230, "be": 231, "sent": 232, "bankruptcy": 233, "act": 234, "fast": 235, "62": 236, "dropped": 237, "24": 238, "hours": 239, "cut": 240, "think": 241, "we": 242, "might": 243, "resident": 244, "removing": 245, "ex": 246, "divorce": 247, "final": 248, "decree": 249, "issued": 250, "week": 251, "psychiatric": 252, "provider": 253, "approved": 254, "social": 255, "security": 256, "under": 257, "65": 258, "ended": 259, "september": 260, "30th": 261, "dependents": 262, "continuation": 263, "salary": 264, "51": 265, "18": 266, "500": 267, "quickly": 268, "months": 269, "annual": 270, "determine": 271, "subsidy": 272, "consultant": 273, "38": 274, "turning": 275, "26": 276, "aging": 277, "parents'": 278, "own": 279, "through": 280, "requires": 281, "cardiologist": 282, "before": 283, "fibromyalgia": 284, "fatigue": 285, "syndrome": 286, "anymore": 287, "apply": 288, "needed": 289, "eliminated": 290, "effective": 291, "immediately": 292, "family": 293, "four": 294, "5": 295, "9": 296, "earning": 297, "72": 298, "are": 299, "options": 300, "applied": 301, "they're": 302, "asking": 303, "more": 304, "part": 305, "time": 306, "retail": 307, "15": 308, "dependent": 309}